rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_MSCM.h
#define MSCM_IRCP0IGR2_INT_EN_MASK               (0x1U)
#define MSCM_IRCP0IGR2_INT_EN_SHIFT              (0U)
#define MSCM_IRCP0IGR2_INT_EN_WIDTH              (1U)
#define MSCM_IRCP0IGR2_INT_EN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP0IGR2_INT_EN_SHIFT)) & MSCM_IRCP0IGR2_INT_EN_MASK)
/*! @} */

/*! @name IRCP0ISR3 - Interrupt Router CP0 Interrupt Status */
/*! @{ */

#define MSCM_IRCP0ISR3_CP0_INT_MASK              (0x1U)
#define MSCM_IRCP0ISR3_CP0_INT_SHIFT             (0U)
#define MSCM_IRCP0ISR3_CP0_INT_WIDTH             (1U)
#define MSCM_IRCP0ISR3_CP0_INT(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP0ISR3_CP0_INT_SHIFT)) & MSCM_IRCP0ISR3_CP0_INT_MASK)

#define MSCM_IRCP0ISR3_CP1_INT_MASK              (0x2U)
#define MSCM_IRCP0ISR3_CP1_INT_SHIFT             (1U)
#define MSCM_IRCP0ISR3_CP1_INT_WIDTH             (1U)
#define MSCM_IRCP0ISR3_CP1_INT(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP0ISR3_CP1_INT_SHIFT)) & MSCM_IRCP0ISR3_CP1_INT_MASK)
/*! @} */

/*! @name IRCP0IGR3 - Interrupt Router CP0 Interrupt Generation */
/*! @{ */

#define MSCM_IRCP0IGR3_INT_EN_MASK               (0x1U)
#define MSCM_IRCP0IGR3_INT_EN_SHIFT              (0U)
#define MSCM_IRCP0IGR3_INT_EN_WIDTH              (1U)
#define MSCM_IRCP0IGR3_INT_EN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_IRCP0IGR3_INT_EN_SHIFT)) & MSCM_IRCP0IGR3_INT_EN_MASK)
/*! @} */

/*! @name IRCPCFG - Interrupt Router Configuration */
/*! @{ */

#define MSCM_IRCPCFG_CP0_TR_MASK                 (0x1U)
#define MSCM_IRCPCFG_CP0_TR_SHIFT                (0U)
#define MSCM_IRCPCFG_CP0_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP0_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP0_TR_SHIFT)) & MSCM_IRCPCFG_CP0_TR_MASK)

#define MSCM_IRCPCFG_CP1_TR_MASK                 (0x2U)
#define MSCM_IRCPCFG_CP1_TR_SHIFT                (1U)
#define MSCM_IRCPCFG_CP1_TR_WIDTH                (1U)
#define MSCM_IRCPCFG_CP1_TR(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_CP1_TR_SHIFT)) & MSCM_IRCPCFG_CP1_TR_MASK)

#define MSCM_IRCPCFG_LOCK_MASK                   (0x80000000U)
#define MSCM_IRCPCFG_LOCK_SHIFT                  (31U)
#define MSCM_IRCPCFG_LOCK_WIDTH                  (1U)
#define MSCM_IRCPCFG_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_IRCPCFG_LOCK_SHIFT)) & MSCM_IRCPCFG_LOCK_MASK)
/*! @} */

/*! @name XN_CTRL - Memory Execution Control */
/*! @{ */

#define MSCM_XN_CTRL_PRAM0_MASK                  (0x1U)
#define MSCM_XN_CTRL_PRAM0_SHIFT                 (0U)
#define MSCM_XN_CTRL_PRAM0_WIDTH                 (1U)
#define MSCM_XN_CTRL_PRAM0(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_PRAM0_SHIFT)) & MSCM_XN_CTRL_PRAM0_MASK)

#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_MASK    (0x100U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_SHIFT   (8U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_WIDTH   (1U)
#define MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_0_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_0_ITCM_MASK             (0x1000U)
#define MSCM_XN_CTRL_CM7_0_ITCM_SHIFT            (12U)
#define MSCM_XN_CTRL_CM7_0_ITCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_0_ITCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_ITCM_SHIFT)) & MSCM_XN_CTRL_CM7_0_ITCM_MASK)

#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_MASK (0x10000U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_SHIFT (16U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC(x)  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_SHIFT)) & MSCM_XN_CTRL_CM7_0_DIS_D0_D1TCM_EXEC_MASK)

#define MSCM_XN_CTRL_CM7_0_DTCM_MASK             (0x100000U)
#define MSCM_XN_CTRL_CM7_0_DTCM_SHIFT            (20U)
#define MSCM_XN_CTRL_CM7_0_DTCM_WIDTH            (1U)
#define MSCM_XN_CTRL_CM7_0_DTCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_CM7_0_DTCM_SHIFT)) & MSCM_XN_CTRL_CM7_0_DTCM_MASK)

#define MSCM_XN_CTRL_SLK_MASK                    (0x40000000U)
#define MSCM_XN_CTRL_SLK_SHIFT                   (30U)
#define MSCM_XN_CTRL_SLK_WIDTH                   (1U)
#define MSCM_XN_CTRL_SLK(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_SLK_SHIFT)) & MSCM_XN_CTRL_SLK_MASK)

#define MSCM_XN_CTRL_HLK_MASK                    (0x80000000U)
#define MSCM_XN_CTRL_HLK_SHIFT                   (31U)
#define MSCM_XN_CTRL_HLK_WIDTH                   (1U)
#define MSCM_XN_CTRL_HLK(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL_HLK_SHIFT)) & MSCM_XN_CTRL_HLK_MASK)
/*! @} */

/*! @name ENEDC - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC_CM7_0_AHBM_MASK               (0x1U)
#define MSCM_ENEDC_CM7_0_AHBM_SHIFT              (0U)
#define MSCM_ENEDC_CM7_0_AHBM_WIDTH              (1U)
#define MSCM_ENEDC_CM7_0_AHBM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_0_AHBM_SHIFT)) & MSCM_ENEDC_CM7_0_AHBM_MASK)

#define MSCM_ENEDC_CM7_0_AHBP_MASK               (0x2U)
#define MSCM_ENEDC_CM7_0_AHBP_SHIFT              (1U)
#define MSCM_ENEDC_CM7_0_AHBP_WIDTH              (1U)
#define MSCM_ENEDC_CM7_0_AHBP(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_0_AHBP_SHIFT)) & MSCM_ENEDC_CM7_0_AHBP_MASK)

#define MSCM_ENEDC_EDMA_MASK                     (0x4U)
#define MSCM_ENEDC_EDMA_SHIFT                    (2U)
#define MSCM_ENEDC_EDMA_WIDTH                    (1U)
#define MSCM_ENEDC_EDMA(x)                       (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_EDMA_SHIFT)) & MSCM_ENEDC_EDMA_MASK)

#define MSCM_ENEDC_HSE_MASK                      (0x10U)
#define MSCM_ENEDC_HSE_SHIFT                     (4U)
#define MSCM_ENEDC_HSE_WIDTH                     (1U)
#define MSCM_ENEDC_HSE(x)                        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_HSE_SHIFT)) & MSCM_ENEDC_HSE_MASK)

#define MSCM_ENEDC_ADD_PF0_MASK                  (0x200U)
#define MSCM_ENEDC_ADD_PF0_SHIFT                 (9U)
#define MSCM_ENEDC_ADD_PF0_WIDTH                 (1U)
#define MSCM_ENEDC_ADD_PF0(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_PF0_SHIFT)) & MSCM_ENEDC_ADD_PF0_MASK)

#define MSCM_ENEDC_PRAM0_MASK                    (0x1000U)
#define MSCM_ENEDC_PRAM0_SHIFT                   (12U)
#define MSCM_ENEDC_PRAM0_WIDTH                   (1U)
#define MSCM_ENEDC_PRAM0(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PRAM0_SHIFT)) & MSCM_ENEDC_PRAM0_MASK)

#define MSCM_ENEDC_ADD_PRAM0_MASK                (0x2000U)
#define MSCM_ENEDC_ADD_PRAM0_SHIFT               (13U)
#define MSCM_ENEDC_ADD_PRAM0_WIDTH               (1U)
#define MSCM_ENEDC_ADD_PRAM0(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_PRAM0_SHIFT)) & MSCM_ENEDC_ADD_PRAM0_MASK)

#define MSCM_ENEDC_ADD_TCM_BACKDOOR_MASK         (0x20000U)
#define MSCM_ENEDC_ADD_TCM_BACKDOOR_SHIFT        (17U)
#define MSCM_ENEDC_ADD_TCM_BACKDOOR_WIDTH        (1U)
#define MSCM_ENEDC_ADD_TCM_BACKDOOR(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_TCM_BACKDOOR_SHIFT)) & MSCM_ENEDC_ADD_TCM_BACKDOOR_MASK)

#define MSCM_ENEDC_AIPS0_MASK                    (0x100000U)
#define MSCM_ENEDC_AIPS0_SHIFT                   (20U)
#define MSCM_ENEDC_AIPS0_WIDTH                   (1U)
#define MSCM_ENEDC_AIPS0(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AIPS0_SHIFT)) & MSCM_ENEDC_AIPS0_MASK)

#define MSCM_ENEDC_ADD_AIPS0_MASK                (0x200000U)
#define MSCM_ENEDC_ADD_AIPS0_SHIFT               (21U)
#define MSCM_ENEDC_ADD_AIPS0_WIDTH               (1U)
#define MSCM_ENEDC_ADD_AIPS0(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_AIPS0_SHIFT)) & MSCM_ENEDC_ADD_AIPS0_MASK)

#define MSCM_ENEDC_CM7_0_TCM_MASK                (0x4000000U)
#define MSCM_ENEDC_CM7_0_TCM_SHIFT               (26U)
#define MSCM_ENEDC_CM7_0_TCM_WIDTH               (1U)
#define MSCM_ENEDC_CM7_0_TCM(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_CM7_0_TCM_SHIFT)) & MSCM_ENEDC_CM7_0_TCM_MASK)

#define MSCM_ENEDC_ADD_CM7_0_TCM_MASK            (0x8000000U)
#define MSCM_ENEDC_ADD_CM7_0_TCM_SHIFT           (27U)
#define MSCM_ENEDC_ADD_CM7_0_TCM_WIDTH           (1U)
#define MSCM_ENEDC_ADD_CM7_0_TCM(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_CM7_0_TCM_SHIFT)) & MSCM_ENEDC_ADD_CM7_0_TCM_MASK)
/*! @} */

/*! @name IAHBCFGREG - AHB Gasket Configuration */
/*! @{ */

#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK (0x2U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK (0x4U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT (2U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_DMA_AXBS_S1_DIS_WR_OPT_MASK)

